var አንዶ = ['፩', '፪', '፫', '፬', '፭', '፮', '፯', '፰', '፱'];
var አስሮ = ['፲', '፳', '፴', '፵', '፶', '፷', '፸', '፹', '፺'];
var እልፎ = ['፻', '፼'];
function ቀዳሜ() {
    var ቁጥሯ = 768564;
    console.log("ከዓረብኛ ወደ ግእዝ \ቁጥር መቀየርያ መተግበርያ");
    console.log("==================================");
    console.log('የተጻፈው \ቁጥር: ', ቁጥሯ);
    console.log('በግእዝ ---> ', ቁጥሩ_ግእዝ(ቁጥሯ));
}
ቀዳሜ();
function ቁጥሩ_ግእዝ(ቁጥሩ) {
    var ቁጥር_ሀረግ = ቁጥሩ.toString();
    var እልፍ = '';
    var ብዛቱ = 0;
    if (ቁጥር_ሀረግ.length % 2 == 0)
        ብዛቱ = ቁጥር_ሀረግ.length / 2;
    else
        ብዛቱ = (ቁጥር_ሀረግ.length / 2) + 1;
    var ግእዝ_ቁ = '';
    var ነጠላቁ1 = '';
    var ነጠላቁ2 = '';
    var ተሌ = ቁጥር_ሀረግ;
    for (var ለ = 1; ለ <= (ብዛቱ); ለ++) {
        switch (ለ) {
            case 1:
                እልፍ = '';
                break;
            case 2:
                እልፍ = እልፎ[0];
                break;
            case 3:
                እልፍ = እልፎ[1];
                break;
            case 4:
                እልፍ = እልፎ[1] + እልፎ[0];
                break;
            case 5:
                እልፍ = እልፎ[1] + እልፎ[1];
                break;
            case 6:
                እልፍ = እልፎ[1] + እልፎ[1] + እልፎ[0];
                break;
            case 7:
                እልፍ = እልፎ[1] + እልፎ[1] + እልፎ[1];
                break;
            case 8:
                እልፍ = እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[0];
                break;
            case 9:
                እልፍ = እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1];
                break;
            case 10:
                እልፍ = እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[0];
                break;
            case 11:
                እልፍ = እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1];
                break;
            case 12:
                እልፍ = እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[0];
                break;
            case 13:
                እልፍ = እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1];
                break;
            case 14:
                እልፍ = እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[0];
                break;
            case 15:
                እልፍ = እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1];
                break;
            case 16:
                እልፍ = እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[0];
                break;
            case 17:
                እልፍ = እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1];
                break;
            case 18:
                እልፍ = እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1] + እልፎ[1];
                break;
        }
        ነጠላቁ1 = ተሌ[ተሌ.length - 1];
        if (ተሌ.length == 1)
            ነጠላቁ2 = '0';
        else
            ነጠላቁ2 = ተሌ[ተሌ.length - 2];
        if (ነጠላቁ1 == '0' && ነጠላቁ2 == '0') {
            እልፍ = '';
        }
        ግእዝ_ቁ += እልፍ;
        if (ነጠላቁ1 == '0') {
            ግእዝ_ቁ += '';
        }
        else {
            if (ለ > 1 && ነጠላቁ2 == '0' && ነጠላቁ1 == '1')
                ግእዝ_ቁ += '';
            else
                ግእዝ_ቁ += አንዶ[parseInt(ነጠላቁ1) - 1];
        }
        if (ነጠላቁ2 == '0') {
            ግእዝ_ቁ += '';
        }
        else {
            ግእዝ_ቁ += አስሮ[parseInt(ነጠላቁ2) - 1];
        }
        ተሌ = ተሌ.slice(0, ተሌ.length - 2);
    }
    var መልሱ = '';
    for (var ለ = 0; ለ < ግእዝ_ቁ.length; ለ++) {
        መልሱ += ግእዝ_ቁ[ግእዝ_ቁ.length - 1 - ለ];
    }
    return መልሱ;
}
